<template>
  <div :class="[services[0].slug,services[0].theme]">
    <jumbotron :image="image" :pageTitle="pageTitle"></jumbotron>
    <about-section :about="this.services[0].about_section" :boxes="services[0].boxes"></about-section>
    <why-us
      v-if="this.$route.params.permalink === 'seo'"
      :items="services[0].whyus.accordions"
      :image="services[0].whyus.imageUrl"
      :title="services[0].whyus.title"
    ></why-us>
    <div class="brands mb-50" v-if="this.$route.params.permalink === 'e-commerce'">
      <div class="container">
        <div class="row">
          <div class="col-md-2 col-6" v-for="(logo,index) in services[0].logos" :key="index">
            <div class="icon d-flex align-items-center justify-content-center h-100">
              <img :src="logo.image" class="img-fluid" />
            </div>
          </div>
        </div>
      </div>
    </div>
    <mobile-compare v-if="this.$route.params.permalink === 'mobile-development'"></mobile-compare>
    <feature-section
      :textTitle="services[0].features.title"
      :description="services[0].features.description"
      :features="services[0].features.items"
    ></feature-section>
    <works-section
      v-if="this.$route.params.permalink !== 'seo' && this.$route.params.permalink !== 'hosting'"
      :filter="false"
      :title="services[0].works.title"
      class="pt-100"
    ></works-section>
    <prices v-if="this.$route.params.permalink === 'hosting'"></prices>
    <compare v-if="this.$route.params.permalink === 'hosting'"></compare>
    <contact :theme="services[0].theme"></contact>
  </div>
</template>
<script>
import Jumbotron from "../../components/global/Jumbotron";
import AboutSection from "../../components/services/AboutSection";
import FeatureSection from "../../components/services/FeatureSection";
import Prices from "../../components/services/Prices";
import Compare from "../../components/services/Compare";
import MobileCompare from "../../components/services/MobileCompare";
import WhyUs from "../../components/global/WhyUs";
import WorksSection from "../../components/global/WorksSection";
import Contact from "../../components/global/Contact";
export default {
  components: {
    Jumbotron,
    AboutSection,
    WhyUs,
    WorksSection,
    Contact,
    FeatureSection,
    Prices,
    Compare,
    MobileCompare
  },
  data() {
    return {
      image: `/img/${this.$route.params.permalink}/slider.jpg`,
      pageTitle: null,
      services: [
        {
          // Web-Development
          title: "برمجة المواقع الالكترونية",
          slug: "web-development",
          theme: "yellow",
          about_section: {
            image: "/img/web-development/about_image.png",
            title: "ماتقدمة أصول من حلول لبرمجة المواقع",
            description:
              "تستخدم نص لوريم إيبسوم ما عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة مخبأة في هذا النص بينما تعمل جميع مولّدات نصوص لوريم إيبسوم على الإنترنت على إعادة تكرار مقاطع من نص لوريم إيبسوم نفسه عدة .مرات بما تتطلبه الحاجة",
            theme: "yellow"
          },
          boxes: [
            {
              image: "icon-4",
              title: "لوحة تحكم مميزة",
              description:
                "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر",
              theme: "red"
            },
            {
              image: "icon-coding",
              title: "لغات متعددة",
              description:
                "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر",
              theme: "blue"
            },
            {
              image: "icon-77",
              title: "الالتزام الكامل",
              description:
                "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر",
              theme: "yellow"
            }
          ],
          features: {
            title: "مميزات تصميم موقع مع أصول تك",
            description:
              "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص إن كنت تريد أن تستخدم نص لوريم إيبسوم ما عليك أن تتحقق أولاً أن ليس هناك أي كلمات",
            items: [
              {
                image: "icon-33",
                title: "سهولة الاستخدام",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-icon_01",
                title: "واجهة استخدام بلغتين (عربى / إنجليزى)",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-35",
                title: "سهولة الاستخدام",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-32",
                title: "سهولة الاستخدام",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-31",
                title: "سهولة الاستخدام",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-55",
                title: "سهولة الاستخدام",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-4",
                title: "سهولة الاستخدام",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-27",
                title: "سهولة الاستخدام",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              }
            ]
          },
          works: {
            title: "باقة من آخر أعمالنا في تصميم المواقع"
          }
        },
        {
          // E-commerce
          title: "تصميم المتاجر الكترونية",
          slug: "e-commerce",
          theme: "blue",
          about_section: {
            image: "/img/e-commerce/about_image.png",
            title: "انطلق بتجارتك من مجرد محل تجاري !الى كل العالم",
            description:
              "تستخدم نص لوريم إيبسوم ما عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة مخبأة في هذا النص بينما تعمل جميع مولّدات نصوص لوريم إيبسوم على الإنترنت على إعادة تكرار مقاطع من نص لوريم إيبسوم نفسه عدة .مرات بما تتطلبه الحاجة",
            theme: "red"
          },
          boxes: [
            {
              image: "icon-24",
              title: "اقسام ومنتجات غير محدودة",
              description:
                "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر",
              theme: "red"
            },
            {
              image: "icon-35",
              title: "التحكم في الطلبات",
              description:
                "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر",
              theme: "blue"
            },
            {
              image: "icon-wordpress",
              title: "بوابة دفع بالفيزا وبطاقات مدى",
              description:
                "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر",
              theme: "yellow"
            }
          ],
          logos: [
            { image: "/img/e-commerce/opencart.png" },
            { image: "/img/e-commerce/woocommerce.png" },
            { image: "/img/e-commerce/magento.png" },
            { image: "/img/e-commerce/xcart.png" },
            { image: "/img/e-commerce/drupal.png" },
            { image: "/img/e-commerce/laravel.png" }
          ],
          features: {
            title: "مميزات تصميم متجر مع أصول تك",
            description:
              "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص إن كنت تريد أن تستخدم نص لوريم إيبسوم ما عليك أن تتحقق أولاً أن ليس هناك أي كلمات",
            items: [
              {
                image: "icon-21",
                title: "اقسام ومنتجات غير محدودة",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-26",
                title: "سهولة أنهاء الشراء",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-25",
                title: "تقييم المنتجات والتعليق",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-23",
                title: "التحكم في الطلبات",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-76",
                title: "تقارير متقدمة ومفصلة",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-75",
                title: "مقارنة المنتجات",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-72",
                title: "اداره المخزون للمنتج",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-74",
                title: "تسجيل الدخول بالشبكات الاجتماعية",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              }
            ]
          },
          works: {
            title: "باقة من آخر أعمالنا في تصميم المتاجر"
          }
        },
        {
          title: "تصميم مواقع إحترافية",
          slug: "web-design",
          theme: "red",
          about_section: {
            image: "/img/web-design/about_image.png",
            title: "ماتقدمة أصول من حلول لبرمجة المواقع",
            description:
              "تستخدم نص لوريم إيبسوم ما عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة مخبأة في هذا النص بينما تعمل جميع مولّدات نصوص لوريم إيبسوم على الإنترنت على إعادة تكرار مقاطع من نص لوريم إيبسوم نفسه عدة .مرات بما تتطلبه الحاجة",
            theme: "red"
          },
          boxes: [
            {
              image: "icon-24",
              title: "لوحة تحكم مميزة",
              description:
                "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر",
              theme: "red"
            },
            {
              image: "icon-35",
              title: "لغات متعددة",
              description:
                "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر",
              theme: "blue"
            },
            {
              image: "icon-wordpress",
              title: "الالتزام الكامل",
              description:
                "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر",
              theme: "yellow"
            }
          ],
          features: {
            title: "مميزات تصميم موقع مع أصول تك",
            description:
              "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص إن كنت تريد أن تستخدم نص لوريم إيبسوم ما عليك أن تتحقق أولاً أن ليس هناك أي كلمات",
            items: [
              {
                image: "icon-33",
                title: "سهولة الاستخدام",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-icon_01",
                title: "واجهة استخدام بلغتين (عربى / إنجليزى)",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-35",
                title: "سهولة الاستخدام",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-32",
                title: "سهولة الاستخدام",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-31",
                title: "سهولة الاستخدام",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-55",
                title: "سهولة الاستخدام",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-4",
                title: "سهولة الاستخدام",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-27",
                title: "سهولة الاستخدام",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              }
            ]
          },
          works: {
            title: "باقة من آخر أعمالنا في تصميم المواقع"
          }
        },
        {
          title: "تهيئة المواقع",
          slug: "seo",
          theme: "red",
          about_section: {
            image: "/img/seo/about_image.png",
            title: "ماتقدمة أصول من حلول لبرمجة المواقع",
            description:
              "تستخدم نص لوريم إيبسوم ما عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة مخبأة في هذا النص بينما تعمل جميع مولّدات نصوص لوريم إيبسوم على الإنترنت على إعادة تكرار مقاطع من نص لوريم إيبسوم نفسه عدة .مرات بما تتطلبه الحاجة",
            theme: "red"
          },
          boxes: [
            {
              image: "icon-22",
              title: "لوحة تحكم مميزة",
              description:
                "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر",
              theme: "red"
            },
            {
              image: "icon-team",
              title: "لغات متعددة",
              description:
                "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر",
              theme: "blue"
            },
            {
              image: "icon-27",
              title: "الالتزام الكامل",
              description:
                "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر",
              theme: "yellow"
            }
          ],
          features: {
            title: "مميزات تصميم موقع مع أصول تك",
            description:
              "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص إن كنت تريد أن تستخدم نص لوريم إيبسوم ما عليك أن تتحقق أولاً أن ليس هناك أي كلمات",
            items: [
              {
                image: "icon-33",
                title: "سهولة الاستخدام",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-icon_01",
                title: "واجهة استخدام بلغتين (عربى / إنجليزى)",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-35",
                title: "سهولة الاستخدام",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-32",
                title: "سهولة الاستخدام",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-31",
                title: "سهولة الاستخدام",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-55",
                title: "سهولة الاستخدام",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-4",
                title: "سهولة الاستخدام",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-27",
                title: "سهولة الاستخدام",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              }
            ]
          },
          works: {
            title: "باقة من آخر أعمالنا في تصميم المواقع"
          },
          whyus: {
            imageUrl: "/img/svg/whyus.svg",
            title: "الأسئلة الشائعة",
            accordions: [
              {
                accordionTitle: "لماذا SEO مهم لعملك؟",
                accordionDescription:
                  "لكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص إن كنت تريد أن تستخدم نص لوريم إيبسوم ما عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة مخبأة في هذا النص"
              },
              {
                accordionTitle: "هل سيكون موقعي مواكب مع آخر تحديثات جوجل؟",
                accordionDescription:
                  "لكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص إن كنت تريد أن تستخدم نص لوريم إيبسوم ما عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة مخبأة في هذا النص"
              },
              {
                accordionTitle: "كم سوف تستغرق من الوقت رؤية نتائج SEO؟",
                accordionDescription:
                  "لكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص إن كنت تريد أن تستخدم نص لوريم إيبسوم ما عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة مخبأة في هذا النص"
              },
              {
                accordionTitle: "هل نضمن لك تصنيف موقعك في النتيجة الأولى",
                accordionDescription:
                  "لكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص إن كنت تريد أن تستخدم نص لوريم إيبسوم ما عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة مخبأة في هذا النص"
              }
            ]
          }
        },
        {
          title: "استضافة المواقع",
          slug: "hosting",
          theme: "blue",
          about_section: {
            image: "/img/hosting/about_image.png",
            title: "ماتقدمة أصول من حلول لبرمجة المواقع",
            description:
              "تستخدم نص لوريم إيبسوم ما عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة مخبأة في هذا النص بينما تعمل جميع مولّدات نصوص لوريم إيبسوم على الإنترنت على إعادة تكرار مقاطع من نص لوريم إيبسوم نفسه عدة .مرات بما تتطلبه الحاجة",
            theme: "yellow"
          },
          boxes: [
            {
              image: "icon-13123",
              title: "لوحة تحكم مميزة",
              description:
                "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر",
              theme: "red"
            },
            {
              image: "icon-12",
              title: "لغات متعددة",
              description:
                "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر",
              theme: "blue"
            },
            {
              image: "icon-43",
              title: "الالتزام الكامل",
              description:
                "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر",
              theme: "yellow"
            }
          ],
          features: {
            title: "مميزات تصميم موقع مع أصول تك",
            description:
              "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص إن كنت تريد أن تستخدم نص لوريم إيبسوم ما عليك أن تتحقق أولاً أن ليس هناك أي كلمات",
            items: [
              {
                image: "icon-44",
                title: "سعة التخزين",
                description:
                  "سعة تخزين تصل إلى 100 جيجا لموقعك وبريدك الإلكتروني"
              },
              {
                image: "icon-52",
                title: "النطاق",
                description: "إمكانية تسجيل أو ربط نطاق"
              },
              {
                image: "icon-40",
                title: "سكربتات",
                description: "تثبيت تلقائي للسكريبتات (وردبريس وجوملا والمزيد)"
              },
              {
                image: "icon-49",
                title: "أصدارات Php",
                description:
                  "مجموعة واسعة من إصدارات PHP يُمكن الإختيار منها (5.5, 5.6, 7.0, 7.1, 7.2, 7.3, 7.4)"
              },
              {
                image: "icon-39",
                title: "قواعد البيانات",
                description: "قواعد بيانات MySQL وSQLite"
              },
              {
                image: "icon-47",
                title: "السعة",
                description: "سعة نقل شهرية غير محدودة"
              },
              {
                image: "icon-8",
                title: "احصائيات",
                description: "برنامج إحصائيات مدمج"
              },
              {
                image: "icon-51",
                title: "الدعم الفنى",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              }
            ]
          }
        },

        {
          title: "برمجة تطبيقات الجوال",
          slug: "mobile-development",
          theme: "yellow",
          about_section: {
            image: "/img/mobile-development/about_image.png",
            title:
              "تنقل افكار من الذهن الى الحقيقة هل لديك فكره طموحة وتبي تحولها لتطبيق ناجح؟",
            description:
              "تستخدم نص لوريم إيبسوم ما عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة مخبأة في هذا النص بينما تعمل جميع مولّدات نصوص لوريم إيبسوم على الإنترنت على إعادة تكرار مقاطع من نص لوريم إيبسوم نفسه عدة .مرات بما تتطلبه الحاجة",
            theme: "yellow"
          },
          boxes: [
            {
              image: "icon-8",
              title: "لوحة تحكم مميزة",
              description:
                "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر",
              theme: "red"
            },
            {
              image: "icon-94",
              title: "لغات متعددة",
              description:
                "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر",
              theme: "blue"
            },
            {
              image: "icon-77",
              title: "الالتزام الكامل",
              description:
                "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر",
              theme: "yellow"
            }
          ],
          features: {
            title: "مميزات تصميم موقع مع أصول تك",
            description:
              "هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص إن كنت تريد أن تستخدم نص لوريم إيبسوم ما عليك أن تتحقق أولاً أن ليس هناك أي كلمات",
            items: [
              {
                image: "icon-89",
                title: "خصوصية لمشروعك",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-88",
                title: "نشاركك النجاح",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-86",
                title: "تحديثات مجانية",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-92",
                title: "متوافق لجميع المقاسات",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-78",
                title: "تصميم مُبدع",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-91",
                title: "بنرات إعلانية",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-8",
                title: "لوحة تحكم قوية",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              },
              {
                image: "icon-51",
                title: "الدعم الفنى",
                description:
                  "هنالك العديد الأنواع المتوفرة لنصوص لوريم إيبسوم .ولكن الغالبية تم تعديلها بشكل ما"
              }
            ]
          },
          works: {
            title: "باقة من آخر أعمالنا في تصميم المواقع"
          }
        }
      ]
    };
  },
  created() {
    const newVal = this.services.filter(
      i => i.slug === this.$route.params.permalink
    );
    this.services = newVal;
    this.pageTitle = this.services[0].title;
  }
};
</script>

<style lang="scss" scoped>
.brands {
  .icon {
    margin-bottom: 30px;
  }
}
</style>